Repository: mikayil-c/project-weather
Catalog: lib/l10n/app_*.arb
Languages: az, tr

# lookingToSky
source: Looking to the sky...
az: Göyə baxılır...
tr: Gökyüzüne bakıyor...

source: Starting feels wrong...
az: Başlama düzgün hiss olunmur...
tr: Başlangıç yanlış görünüyor...

# somethingWrongWithInternet
source: There is something wrong with internet...
az: İnternetlə problem var...
tr: İnternette bir sorun var...

source: Please try again.
az: Zəhmət olmasa, yenidən cəhd edin.
tr: Lütfen tekrar deneyin.

# introDetail
source: To start the app select a location or allow us to find your location
az: Tətbiqi başlatmaq üçün məkan seçin və ya yerinizi tapmağımıza icazə verin
tr: Uygulamayı başlatmak için bir konum seçin veya konumunuzu bulmamıza izin verin

# introSelectButton
source: Select location
az: Məkan seç
tr: Konum seç

# introFindButton
source: Automate my location
az: Yerimi avtomatik tap
tr: Konumumu otomatik bul

# locSelectHint
source: search
az: axtar
tr: ara

# locSelectEnterName
source: Enter a location name
az: Məkan adı daxil edin
tr: Bir yer adı girin

# locSelectNoLocations
source: No locations found
az: Məkan tapılmadı
tr: Hiçbir konum bulunamadı

# locSelectGettingInfos
source: Getting infos from birds...
az: Quşlardan məlumat alınır...
tr: Bilgiler kuşlardan alınıyor...

source: Settings
az: Parametrlər
tr: Ayarlar

source: Select location
az: Məkan seç
tr: Konum seç

source: Try again
az: Yenidən cəhd et
tr: Tekrar dene

# noSavedLocations
source: No saved location
az: Saxlanılmış məkan yoxdur
tr: Kayıtlı konum yok

source: latest
az: ən son
tr: son

source: feels like
az: hiss olunur
tr: hissedilen

# daysNotAppeared
source: Oops. Days not appeared :(
az: Oops. Günlər görünmədi :(
tr: Hata. Günler görünmedi :(

# northLetter
source: N
az: Ş
tr: K

# southLetter
source: S
az: C
tr: G

# westLetter
source: W
az: Q
tr: B

# eastLetter
source: E
az: Ş
tr: D

source: Wind
az: Külək
tr: Rüzgar

source: Unit
az: Vahid
tr: Birim

source: Reset All Data
az: Bütün məlumatları sıfırla
tr: Tüm verileri sıfırla

# selectUnit
source: Select a unit
az: Ölçü vahidini seçin
tr: Birim seç

source: OK
tr: Tamam

source: Cancel
az: Ləğv et
tr: İptal

source: Clear
az: Təmizlə
tr: Temizle

# thisWillClearAllData
source: This will clear all data(including locations) and navigate to intro page.
az: Bu bütün məlumatları (məkanlar daxil olmaqla) siləcək və giriş səhifəsinə qaytaracaq.
tr: Bu işlem tüm verileri (konumlar dahil) temizleyecek ve giriş sayfasına dönecektir.

source: Heavy fog
az: Qatı duman
tr: Yoğun sis

source: Fog
az: Duman
tr: Sis

source: Very low visibility
az: Çox zəif görünüş
tr: Çok düşük görüş

source: Low visibility
az: Zəif görünüş
tr: Düşük görüş

# limited
source: Limited visibility
az: Məhdud görünüş
tr: Sınırlı görüş

# medium
source: Medium visibility
az: Orta görünüş
tr: Orta görüş

# veryClear
source: Very clear visibility
az: Çox aydın görünüş
tr: Çok net görüş

# heavyFogInfo
source: Visibility less than 50m - driving is dangerous
az: Görünüş 50m-dən azdır - sürmək təhlükəlidir
tr: 50 m’nin altında görüş – sürüş tehlikeli

# fogInfo
source: Visibility up to 200m - be careful while driving
az: 200m-ə qədər görünüş - maşın sürərkən diqqətli olun
tr: 200 m’ye kadar görüş – dikkatli sürün

# veryLowVisibilityInfo
source: Fog or heavy rain
az: Duman və ya güclü yağış
tr: Sis veya şiddetli yağmur

# lowVisibilityInfo
source: Light fog or rain
az: Yüngül duman və ya yağış
tr: Hafif sis veya yağmur

# limitedInfo
source: Hazy weather
az: Dumanlı hava
tr: Puslu hava

# mediumVisibilityInfo
source: Medium visibility up to 20km, slightly cloudy
az: Orta görünüş 20 km-ə qədər, az buludlu
tr: 20 km’ye kadar orta görüş, parçalı bulutlu

# clearInfo
source: Good visibility up to 40km, clear weather
az: 40 km-ə qədər yaxşı görünüş, açıq hava
tr: 40 km’ye kadar iyi görüş, açık hava

# veryClearInfo
source: Everything is fine
az: Hər şey qaydasındadır
tr: Her şey yolunda

# lowHum
source: Low
az: Aşağı
tr: Düşük

# mediumHum
source: Medium
az: Orta
tr: Orta

# highHum
source: High
az: Yüksək
tr: Yüksek

# veryHighHum
source: Very high
az: Çox yüksək
tr: Çok yüksek

# lowHumidityInfo
source: Dry air may cause skin and throat dryness
az: Quru hava dəri və boğaz quruluğu yarada bilər
tr: Kuru hava cilt ve boğaz kuruluğuna neden olabilir

# mediumHumidityInfo
source: Comfortable humidity range for most people
az: Çox insanlar üçün rahat rütubət aralığı
tr: Çoğu insan için rahat nem aralığı

# highHumidityInfo
source: High humidity may cause discomfort and reduced sweat evaporation
az: Yüksək rütubət narahatlıq yarada bilər və təri buxarlanmasını azalda bilər
tr: Yüksek nem rahatsızlık verebilir ve terin buharlaşmasını azaltabilir

# veryHighHumidityInfo
source: Very uncomfortable, potentially unhealthy conditions
az: Çox narahat, sağlamlıq üçün təhlükəli ola bilər
tr: Çok rahatsız edici, sağlıksız koşullar olabilir

# veryLowPressure
source: Very low
az: Çox aşağı
tr: Çok düşük

# lowPressure
source: Low
az: Aşağı
tr: Düşük

# mediumPressure
source: Medium
az: Orta
tr: Orta

# highPressure
source: High
az: Yüksək
tr: Yüksek

# veryHighPressure
source: Very high
az: Çox yüksək
tr: Çok yüksek

# veryLowPressureInfo
source: Storms and severe weather conditions are expected
az: Güclü fırtına və sərt hava şəraiti gözlənilir
tr: Fırtına ve şiddetli hava koşulları bekleniyor

# lowPressureInfo
source: Rainy and cloudy weather is possible
az: Yağışlı və buludlu hava mümkündür
tr: Yağmurlu ve bulutlu hava olabilir

# mediumPressureInfo
source: Mixed weather conditions may vary
az: Dəyişkən hava şəraiti ola bilər
tr: Değişken hava koşulları

# highPressureInfo
source: Clear and sunny weather is expected
az: Aydın və günəşli hava gözlənilir
tr: Açık ve güneşli hava bekleniyor

# veryHighPressureInfo
source: Very clear and calm weather conditions
az: Çox aydın və sakit hava şəraiti
tr: Çok açık ve sakin koşullar

# standart
source: Standard
az: Standart
tr: Standart

source: Metric
az: Metrik
tr: Metrik

source: Imperial
tr: İmparatorluk

# calmWind
source: Calm
az: Sakit
tr: Sakin

# lightBreezeWind
source: Light breeze
az: Yüngül meh
tr: Hafif esinti

# gentleBreezeWind
source: Gentle breeze
az: Zərif meh
tr: Tatlı esinti

# moderateBreezeWind
source: Moderate breeze
az: Orta meh
tr: Orta esinti

# strongBreezeWind
source: Strong breeze
az: Güclü meh
tr: Kuvvetli esinti

# galeWind
source: Gale
az: Güclü külək
tr: Fırtına

# stormWind
source: Storm
az: Fırtına
tr: Kasırga

# calmWindInfo
source: Not a leaf is moving
az: Bir yarpaq belə tərpənmir
tr: Hiçbir yaprak kıpırdamıyor

# lightBreezeWindInfo
source: Leaves are swaying
az: Yarpaqlar yellənir
tr: Yapraklar kıpırdıyor

# gentleBreezeWindInfo
source: Branches and small trees are swaying
az: Budaklar və kiçik ağaclar yellənir
tr: Dallar ve küçük ağaçlar sallanıyor

# moderateBreezeWindInfo
source: Big trees are swaying
az: Böyük ağaclar yellənir
tr: Büyük ağaçlar sallanıyor

# strongBreezeWindInfo
source: Trees are bending
az: Ağaclar əyilir
tr: Ağaçlar eğiliyor

# galeWindInfo
source: It is hard to walk outside
az: Çöldə gəzmək çətindir
tr: Dışarıda yürümek zorlaşıyor

# stormWindInfo
source: Dangerous wind
az: Təhlükəli külək
tr: Tehlikeli rüzgar

# failedToSaveLoc
source: Failed to save locations
az: Məkanlar saxlanıla bilmədi
tr: Konumlar kaydedilemedi

source: Failed to save weather
az: Hava məlumatı saxlanıla bilmədi
tr: Hava durumu kaydedilemedi

# failedToSaveDaily
source: Failed to save daily forecast
az: Gündəlik proqnoz saxlanıla bilmədi
tr: Günlük tahminler kaydedilemedi

# failedToSaveHourly
source: Failed to save hourly forecast
az: Saatlıq proqnoz saxlanıla bilmədi
tr: Saatlik tahminler kaydedilemedi

# locModelServiceClosed
source: LocationModel service is closed
az: LocationModel xidməti bağlanıb
tr: LocationModel servisi kapalı

# permissionsDenied
source: LocationModel permissions are denied
az: LocationModel icazələri rədd edildi
tr: LocationModel izinleri reddedildi

# permissionsPermanentlyBanned
source: LocationModel permissions are permanently denied, enable them in settings
az: LocationModel icazələri tamamilə rədd edilib, parametrlərdə aktivləşdirin
tr: LocationModel izinleri kalıcı olarak reddedildi, ayarlardan etkinleştirin

source: Today
az: Bu gün
tr: Bugün

source: Monday
az: Bazar ertəsi
tr: Pazartesi

source: Tuesday
az: Çərşənbə axşamı
tr: Salı

source: Wednesday
az: Çərşənbə
tr: Çarşamba

source: Thursday
az: Cümə axşamı
tr: Perşembe

source: Friday
az: Cümə
tr: Cuma

source: Saturday
az: Şənbə
tr: Cumartesi

source: Sunday
az: Bazar
tr: Pazar

source: January
az: Yanvar
tr: Ocak

source: February
az: Fevral
tr: Şubat

source: March
az: Mart
tr: Mart

source: April
az: Aprel
tr: Nisan

source: May
tr: Mayıs

source: June
az: İyun
tr: Haziran

source: July
az: İyul
tr: Temmuz

source: August
az: Avqust
tr: Ağustos

source: September
az: Sentyabr
tr: Eylül

source: October
az: Oktyabr
tr: Ekim

source: November
az: Noyabr
tr: Kasım

source: December
az: Dekabr
tr: Aralık

source: Language
az: Dil
tr: Dil

# selectLanguage
source: Select a language
az: Dil seçin
tr: Dil seç

source: Detecting location...
az: Məkan aşkarlanır...
tr: Konum algılanıyor...

source: Location detected
az: Məkan aşkarlandı
tr: Konum algılandı

source: Location detection timed out
az: Məkan aşkarlanması vaxtı bitdi
tr: Konum algılama zaman aşımına uğradı

source: Location permission denied
az: Məkan icazəsi rədd edildi
tr: Konum izni reddedildi

source: Location service is disabled
az: Məkan xidməti söndürülüb
tr: Konum servisi devre dışı

source: Failed to detect location
az: Məkan aşkar edilə bilmədi
tr: Konum algılanamadı

source: Retry
az: Yenidən cəhd et
tr: Tekrar dene

# pleaseEnterMoreThanTwoChar
source: Please enter more than 2 characters
az: Zəhmət olmasa 2-dən çox simvol daxil edin
tr: Lütfen 2 karakterden fazla girin

source: Pressure
az: Təzyiq
tr: Basınç

source: Humidity
az: Rütubət
tr: Nem
